var store = [{
        "title": "はじめての投稿",
        "excerpt":"はじめに この記事をはじめに、ブログを書いていこうと思います。内容は主に、プログラミングや数学等についてです。このブログを始めた理由について記録しておきます。 アウトプットしなきゃと思った話 大学に入学してから２年が経ち、就職や院進を意識することが増えました。どちらにするかまだ絞りきれていない僕は、この夏休みのうちにインターンシップに参加しようと考えていました。 インターンに応募するには、大抵の場合、志望理由と同時に自己アピールが聞かれます。そこで僕は、見せれるものが何もないことに気が付きました。 知識欲任せにいろんなことに挑戦してきたつもりでしたが、アウトプットして残しているものがほぼ皆無なため、人に見せるどころか、何をやってきたのか自分でも思い出せない状況でした。これまではなにか完成すれば公開してみようかな、という考えでしたが、製作途中でも記録し発信する大切さに気付かされました。 自分の頭の中にあるものを、客観的に見える形でアウトプットしておく。これをこのブログの第一の目的にします。 そしていつか、このブログを他の人に見てもらうときに、自分がどんなことをしているのか理解してもらう。それを第二の目的にします。 まとめ まず自分のことを知るために、書きたいことを自由に書いていこうと思います。 ","categories": ["jekyll","ブログ"],
        "tags": [],
        "url": "http://localhost:4000/jekyll/%E3%83%96%E3%83%AD%E3%82%B0/%E3%81%AF%E3%81%98%E3%82%81%E3%81%A6%E3%81%AE%E6%8A%95%E7%A8%BF/",
        "teaser":null}]
